#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Tue Nov 27 11:09:30 2018

@author: lulu
"""

"""
字典是支持无限极嵌套的
字典的键不可以是列表，但是值可以是列表
"""
cities = {
        '北京':{
                '朝阳':['国贸','CBD','天阶','我爱我家','链家地产'],
                '海淀':['圆明园','苏州街','中关村','北京大学'],
                '昌平':['沙河','南口','回龙观'],
                '怀柔':['桃花','梅花','大山'],},
        '河北':{
                '石家庄':['石家庄a','石家庄b','石家庄c'],
                '张家口':['张家口a','张家口b','张家口c'],
                '承德':['承德a','承德b','承德c']
                }
        }
for i in cities['北京']:
    print(i)
    
for j in cities['北京']['海淀']:
    print(j)